import numpy as np

fs = 8800 # ЧАСТОТА ДИСКРЕТИЗАЦИИ
dt = 1/fs # ШАГ ДИСКРЕТИЗАЦИИ
N = 10000 # КОЛИЧЕСТВО ТОЧЕК 
t = np.arange(N)*dt #ВЕКТОР ВРЕМЕНИ
N_phi = 1000 # Количество значений угла 
phi_vector = np.linspace(0,2*np.pi,N_phi) # Значения угла от 0 до 2П

# ПАРАМЕТРЫ АВП
M = 5 # КОЛИЧЕСТВО ДАТЧИКОВ
R = 1 # РАДИУС

# ПАРАМЕТРЫ СИГНАЛА 
f = 10 # ЦЕНТРАЛЬНАЯ ЧАСТОТА СИГНАЛА 
A = 1 # АМПЛИТУДА СИГНАЛА 
phi_0 = np.pi/2 # АЗИМУТ ПОД КОТОРЫМ ПРИХОДИТ ИСГНАЛ (ТО ЧТО ОЦЕНИВАЕМ)

# Параметры шумы
sigma_noise = 0.01

TIME_LIMIT = {"left": 0,
        "right": 0.15}